OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f46j53.h
#define _RA0                    0x01
#define _AN0                    0x01
#define _C1INA                  0x01
#define _PMA6                   0x01
#define _RP0                    0x01
#define _ULPWU                  0x01
#define _RA1                    0x02
#define _AN1                    0x02
#define _C2INA                  0x02
#define _PMA7                   0x02
#define _RP1                    0x02
#define _VBG                    0x02
#define _RA2                    0x04
#define _AN2                    0x04
#define _VREF_MINUS             0x04
#define _CVREF                  0x04
#define _C2INB                  0x04
#define _C1IND                  0x04
#define _C3INB                  0x04
#define _RA3                    0x08
#define _AN3                    0x08
#define _VREF_PLUS              0x08
#define _C1INB                  0x08
#define _RA5                    0x20
#define _AN4                    0x20
#define _NOT_SS1                0x20
#define _HLVDIN                 0x20
#define _RCV                    0x20
#define _RP2                    0x20
#define _C1INC                  0x20
#define _RA6                    0x40
#define _OSC2                   0x40
#define _CLKO                   0x40
#define _RA7                    0x80
#define _OSC1                   0x80
#define _CLKI                   0x80

//==============================================================================


//==============================================================================
//        PORTB Bits

extern __at(0x0F81) __sfr PORTB;

typedef union
  {
  struct
    {
    unsigned RB0                : 1;
    unsigned RB1                : 1;
    unsigned RB2                : 1;
    unsigned RB3                : 1;
    unsigned RB4                : 1;
    unsigned RB5                : 1;
    unsigned RB6                : 1;
    unsigned RB7                : 1;
    };

  struct
    {
    unsigned AN12               : 1;
    unsigned AN10               : 1;
    unsigned AN8                : 1;
    unsigned AN9                : 1;
    unsigned PMA1               : 1;
    unsigned PMA0               : 1;
    unsigned KBI2               : 1;
    unsigned KBI3               : 1;
    };

  struct
    {
    unsigned INT0               : 1;
    unsigned PMPBE              : 1;
    unsigned CTED1              : 1;
    unsigned CTED2              : 1;
    unsigned KBI0               : 1;
    unsigned KBI1               : 1;
    unsigned PGC                : 1;
    unsigned PGD                : 1;
    };

  struct
    {
    unsigned RP3                : 1;
    unsigned RTCC               : 1;
    unsigned PMA3               : 1;
    unsigned PMA2               : 1;
    unsigned SCK1               : 1;
    unsigned SDI1               : 1;
    unsigned RP9                : 1;
    unsigned RP10               : 1;
    };

  struct
    {
    unsigned C3IND              : 1;
    unsigned RP4                : 1;
    unsigned VMO                : 1;
    unsigned VPO                : 1;
    unsigned SCL1               : 1;
    unsigned SDA1               : 1;
    unsigned CCP6               : 1;
    unsigned CCP7               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned C3INC              : 1;
    unsigned REFO               : 1;
    unsigned RP6                : 1;
    unsigned RP7                : 1;
    unsigned RP8                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned PMBE               : 1;
    unsigned RP5                : 1;
    unsigned C3INA              : 1;
    unsigned CCP4               : 1;
    unsigned CCP5               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned C2INC              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 4;
    unsigned KBI                : 4;
    };
  } __PORTBbits_t;

extern __at(0x0F81) volatile __PORTBbits_t PORTBbits;

#define _RB0                    0x01
#define _AN12                   0x01
#define _INT0                   0x01
#define _RP3                    0x01
#define _C3IND                  0x01
#define _RB1                    0x02
#define _AN10                   0x02
#define _PMPBE                  0x02
#define _RTCC                   0x02
#define _RP4                    0x02
#define _C3INC                  0x02
#define _PMBE                   0x02
#define _RB2                    0x04
#define _AN8                    0x04
#define _CTED1                  0x04
#define _PMA3                   0x04
#define _VMO                    0x04
#define _REFO                   0x04
#define _RP5                    0x04
#define _C2INC                  0x04
#define _RB3                    0x08
#define _AN9                    0x08
#define _CTED2                  0x08
#define _PMA2                   0x08
#define _VPO                    0x08
#define _RP6                    0x08
#define _C3INA                  0x08
#define _RB4                    0x10
#define _PMA1                   0x10
#define _KBI0                   0x10
#define _SCK1                   0x10
#define _SCL1                   0x10
#define _RP7                    0x10
#define _CCP4                   0x10
#define _RB5                    0x20
#define _PMA0                   0x20
#define _KBI1                   0x20
#define _SDI1                   0x20
#define _SDA1                   0x20
#define _RP8                    0x20
#define _CCP5                   0x20
#define _RB6                    0x40
#define _KBI2                   0x40
#define _PGC                    0x40
#define _RP9                    0x40
#define _CCP6                   0x40
#define _RB7                    0x80
#define _KBI3                   0x80
#define _PGD                    0x80
#define _RP10                   0x80
#define _CCP7                   0x80

//==============================================================================


//==============================================================================
//        PORTC Bits

extern __at(0x0F82) __sfr PORTC;

typedef union
  {
  struct
    {
    unsigned RC0                : 1;
    unsigned RC1                : 1;
    unsigned RC2                : 1;
    unsigned                    : 1;
    unsigned RC4                : 1;
    unsigned RC5                : 1;
    unsigned RC6                : 1;
    unsigned RC7                : 1;
    };

  struct
    {
    unsigned T1OSO              : 1;
    unsigned T1OSI              : 1;
    unsigned AN11               : 1;
    unsigned                    : 1;
    unsigned D_MINUS            : 1;
    unsigned D_PLUS             : 1;
    unsigned PMA5               : 1;
    unsigned PMA4               : 1;
    };

  struct
    {
    unsigned T1CKI              : 1;
    unsigned NOT_UOE            : 1;
    unsigned CTPLS              : 1;
    unsigned                    : 1;
    unsigned VM                 : 1;
    unsigned VP                 : 1;
    unsigned TX1                : 1;
    unsigned RX1                : 1;
    };

  struct
    {
    unsigned RP11               : 1;
    unsigned RP12               : 1;
    unsigned RP13               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CK1                : 1;
    unsigned DT1                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned CCP8               : 1;
    unsigned C2IND              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned RP17               : 1;
    unsigned SDO1               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CCP9               : 1;
    unsigned RP18               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CCP10              : 1;
    };
  } __PORTCbits_t;

